some changes for good
